slackGPT/revalidation_denied/3 RebookAndReprice Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">e3a57a23-cd91-4d99-af49-56c7381e8819
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">
            http://webservices.amadeus.com/Ticket_RebookAndRepricePNR_1.0
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0H4IECITVO</wsse:SessionId>
            <wsse:SequenceNumber>2</wsse:SequenceNumber>
            <wsse:SecurityToken>2TPYISLQY0A5W1OBWRK8ISPJG2</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:AMA_TicketRebookAndRepricePNRRQ xmlns:ns0="http://xml.amadeus.com/2010/06/Ticket_RebookAndRepricePNR_v1"
                                             Actions="" Version="1.0">
            <ns0:Reservation BookingIdentifier="LV4VB6"/>
            <ns0:Commit IgnoreWarningsOption="true" ReceivedFrom="Amadeus WBS"/>
            <ns0:Rebooking>
                <ns0:Cancellation>
                    <ns1:Ref xmlns:ns1="http://xml.amadeus.com/2010/06/Retailing_Types_v2" TattooType="ST"
                             TattooValue="1"/>
                    <ns2:Ref xmlns:ns2="http://xml.amadeus.com/2010/06/Retailing_Types_v2" TattooType="ST"
                             TattooValue="2"/>
                </ns0:Cancellation>
                <ns0:Bounds>
                    <ns0:Bound NIP="1" ActionCode="NN">
                        <ns0:Segment bkgClass="B" isOpenSegment="false" RequestID="SEG1">
                            <ns3:serviceProvider xmlns:ns3="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                                 code="LH"/>
                            <ns4:identifier xmlns:ns4="http://xml.amadeus.com/2010/06/Retailing_Types_v2">31
                            </ns4:identifier>
                            <ns5:start xmlns:ns5="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                       dateTime="2023-07-18T19:00:00">
                                <ns5:locationCode>HAM</ns5:locationCode>
                            </ns5:start>
                            <ns6:end xmlns:ns6="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                     dateTime="2023-07-18T20:10:00">
                                <ns6:locationCode>FRA</ns6:locationCode>
                            </ns6:end>
                        </ns0:Segment>
                        <ns0:Segment bkgClass="B" isOpenSegment="false" RequestID="SEG2">
                            <ns7:serviceProvider xmlns:ns7="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                                 code="LH"/>
                            <ns8:identifier xmlns:ns8="http://xml.amadeus.com/2010/06/Retailing_Types_v2">9572
                            </ns8:identifier>
                            <ns9:start xmlns:ns9="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                       dateTime="2023-07-18T21:15:00">
                                <ns9:locationCode>FRA</ns9:locationCode>
                            </ns9:start>
                            <ns10:end xmlns:ns10="http://xml.amadeus.com/2010/06/Retailing_Types_v2"
                                      dateTime="2023-07-18T22:25:00">
                                <ns10:locationCode>TRS</ns10:locationCode>
                            </ns10:end>
                        </ns0:Segment>
                    </ns0:Bound>
                </ns0:Bounds>
            </ns0:Rebooking>
            <ns0:Repricing>
                <ns0:ItineraryPricingOptions>
                    <ns0:ItineraryPricingOption>
                        <ns11:TicketingInfo xmlns:ns11="http://xml.amadeus.com/2010/06/PricingTypes_v4"
                                            Number="2209792028086"/>
                        <ns12:Booking xmlns:ns12="http://xml.amadeus.com/2010/06/PricingTypes_v4" Operation="SEL"/>
                        <ns13:AssociatedPNRElement xmlns:ns13="http://xml.amadeus.com/2010/06/FareInternalTypes_v2"
                                                   Type="PT" Tattoo="2"/>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns14:TicketingInfo xmlns:ns14="http://xml.amadeus.com/2010/06/PricingTypes_v4">
                            <ns14:FareFamily Name="CLASSIC" Owner="FF"/>
                        </ns14:TicketingInfo>
                        <ns15:AssociatedPNRElement xmlns:ns15="http://xml.amadeus.com/2010/06/FareInternalTypes_v2"
                                                   RefIDs="SEG1"/>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns16:TicketingInfo xmlns:ns16="http://xml.amadeus.com/2010/06/PricingTypes_v4">
                            <ns16:FareFamily Name="CLASSIC" Owner="FF"/>
                        </ns16:TicketingInfo>
                        <ns17:AssociatedPNRElement xmlns:ns17="http://xml.amadeus.com/2010/06/FareInternalTypes_v2"
                                                   RefIDs="SEG2"/>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns18:ServiceProvider xmlns:ns18="http://xml.amadeus.com/2010/06/PricingTypes_v4" Type="VC">LH
                        </ns18:ServiceProvider>
                    </ns0:ItineraryPricingOption>
                    <ns0:ItineraryPricingOption>
                        <ns19:NegotiatedFare xmlns:ns19="http://xml.amadeus.com/2010/06/PricingTypes_v4" Type="RP"/>
                    </ns0:ItineraryPricingOption>
                </ns0:ItineraryPricingOptions>
            </ns0:Repricing>
        </ns0:AMA_TicketRebookAndRepricePNRRQ>
    </soap-env:Body>
</soap-env:Envelope>
